Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/SYITCL/SYITCL.tmx
Source language: en_us
Languages: de_de

source: CLAIMS
de_de: PATENTANSPRÜCHE

source: 1. A radar signal processing method performed by a radar signal processing apparatus, wherein the method comprises the steps of:
de_de: 1. Radarsignalverarbeitungsverfahren, das durch eine Radarsignalverarbeitungsvorrichtung durchgeführt wird, wobei das Verfahren die folgenden Schritte umfasst:

source: transmitting (S 101) a first radar signal on a first frequency band,
de_de: Übertragen (S101) eines ersten Radarsignals auf einem ersten Frequenzband,

source: ○ wherein the first radar signal has a waveform of a first frequency modulated continuous wave, and the first frequency modulated continuous wave is a triangular wave having a rising edge and a falling edge, wherein the rising edge is sent in a first time unit and the falling edge is sent in a second time unit subsequent to the first time unit, the second time unit having a same duration as the first time unit,
de_de: ○ wobei das erste Radarsignal eine Wellenform einer ersten frequenzmodulierten kontinuierlichen Welle aufweist und die erste frequenzmodulierte kontinuierliche Welle eine Dreieckswelle mit einer steigenden Flanke und einer fallenden Flanke ist, wobei die steigende Flanke in einer ersten Zeiteinheit gesendet wird und die fallende Flanke in einer zweiten Zeiteinheit anschließend an die erste Zeiteinheit gesendet wird, wobei die zweite Zeiteinheit dieselbe Dauer wie die erste Zeiteinheit aufweist,

source: so that the sending of the rising edge of the first frequency modulated continuous wave has a same duration as the sending of the falling edge of the first frequency modulated continuous wave;
de_de: so dass das Senden der steigenden Flanke der ersten frequenzmodulierten kontinuierlichen Welle dieselbe Dauer wie das Senden der fallenden Flanke der ersten frequenzmodulierten kontinuierlichen Welle aufweist;

source: transmitting (S 102) a second radar signal on a second frequency band,
de_de: Übertragen (S 102) eines zweiten Radarsignals auf einem zweiten Frequenzband,

source: ○ wherein the second frequency band is non-overlapping with the first frequency band and distanced from the first frequency band,
de_de: ○ wobei das zweite Frequenzband nicht mit dem ersten Frequenzband überlappt und von dem ersten Frequenzband beabstandet ist,

source: ○ wherein the second radar signal has a waveform of a second frequency modulated continuous wave, and the second frequency modulated continuous wave is a triangular wave having a falling edge and a rising edge, wherein the falling edge is sent in the first time unit and the rising edge is sent in the second time unit subsequent to the first time unit,
de_de: ○ wobei das zweite Radarsignal eine Wellenform einer zweiten frequenzmodulierten kontinuierlichen Welle aufweist und die zweite frequenzmodulierte kontinuierliche Welle eine Dreieckswelle mit einer fallenden Flanke und einer steigenden Flanke ist, wobei die fallende Flanke in der ersten Zeiteinheit gesendet wird und die steigende Flanke in der zweiten Zeiteinheit anschließend an die erste Zeiteinheit gesendet wird,

source: so that the sending of the rising edge of the second frequency modulated continuous wave has a same duration as the sending of the falling edge of the second frequency modulated continuous wave,
de_de: so dass das Senden der steigenden Flanke der zweiten frequenzmodulierten kontinuierlichen Welle dieselbe Dauer wie das Senden der fallenden Flanke der zweiten frequenzmodulierten kontinuierlichen Welle aufweist,

source: ○ wherein a starting moment of sending the first frequency modulated continuous wave is the same as a starting moment of sending the second frequency modulated continuous wave, and the starting moment is a beginning of the first time unit,
de_de: ○ wobei ein Startmoment des Sendens der ersten frequenzmodulierten kontinuierlichen Welle derselbe wie ein Startmoment des Sendens der zweiten frequenzmodulierten kontinuierlichen Welle ist und der Startmoment ein Beginn der ersten Zeiteinheit ist,

source: ○ wherein a slope of frequency of the first radar signal and a slope of frequency of the second radar signal have a same absolute value but different signs in each time point during the sending of the first and second frequency modulated continuous waves in the first and second time units,
de_de: ○ wobei eine Steigung der Frequenz des ersten Radarsignals und eine Steigung der Frequenz des zweiten Radarsignals zu jedem Zeitpunkt während des Sendens der ersten und zweiten frequenzmodulierten kontinuierlichen Welle in der ersten und zweiten Zeiteinheit einen gleichen absoluten Wert, aber unterschiedliche Vorzeichen aufweisen,

source: wherein a slope is a variation of frequency of a linear frequency modulated continuous wave in a unit time;
de_de: wobei eine Steigung eine Variation der Frequenz einer linearen frequenzmodulierten kontinuierlichen Welle in einer Zeiteinheit ist;

source: receiving(S 103) a first reflected signal and a second reflected signal, wherein the first reflected signal is an electromagnetic wave obtained after the first radar signal is reflected by a target object, and the second reflected signal is an electromagnetic wave obtained after the second radar signal is reflected by the target object; and
de_de: Empfangen (S 103) eines ersten reflektierten Signals und eines zweiten reflektierten Signals, wobei das erste reflektierte Signal eine elektromagnetische Welle ist, die erhalten wird, nachdem das erste Radarsignal von einem Zielobjekt reflektiert wird, und das zweite reflektierte Signal eine elektromagnetische Welle ist, die erhalten wird, nachdem das zweite Radarsignal von dem Zielobjekt reflektiert wird; und

source: obtaining (S 104) at least one of distance information, velocity information, and angle information of the target object based on the first radar signal, the first reflected signal, the second radar signal, and the second reflected signal.
de_de: Erhalten (S 104) von mindestens einem von Abstandsinformationen, Geschwindigkeitsinformationen und Winkelinformationen des Zielobjekts basierend auf dem ersten Radarsignal, dem ersten reflektierten Signal, dem zweiten Radarsignal und dem zweiten reflektierten Signal.

source: 2. A storage medium, wherein the storage medium stores a computer program; and when the computer program is executed by a processor of a radar signal processing apparatus, the radar signal processing method according to claim 1 is performed.
de_de: 2. Speichermedium, wobei das Speichermedium ein Computerprogramm speichert; und wenn das Computerprogramm durch einen Prozessor einer Radarsignalverarbeitungsvorrichtung ausgeführt wird, das Radarsignalverarbeitungsverfahren nach Anspruch 1 durchgeführt wird.

source: 1. An information transmission method, comprising:
de_de: 1. Informationsübertragungsverfahren, umfassend:

source: receiving (S110,S340) from a first apparatus (600), by a first detection apparatus (500, 700), indication information, wherein the indication information is used to indicate the first detection apparatus to determine a first transmit power used for transmitting a radar signal;
de_de: Empfangen (S110, S340), von einer ersten Vorrichtung (600) durch eine erste Erfassungsvorrichtung (500, 700), von Angabeinformationen, wobei die Angabeinformationen verwendet werden, um der ersten Erfassungsvorrichtung anzugeben, eine erste Übertragungsleistung zu bestimmen, die zum Übertragen eines Radarsignals verwendet wird;

source: determining (S120, S350), by the first detection apparatus, the first transmit power based on the indication information; and
de_de: Bestimmen (S120, S350) der ersten Übertragungsleistung durch die erste Erfassungsvorrichtung basierend auf den Angabeinformationen; und

source: sending, by the first detection apparatus (500, 700), time-frequency resource information and at least one of power information and the indication information, wherein the power information is used to indicate the first transmit power, and the time-frequency resource information is used to indicate a time-frequency resource used for the radar signal.
de_de: Senden, durch die erste Erfassungsvorrichtung (500, 700), von Zeit-Frequenz-Ressourceninformationen und von Leistungsinformationen und/oder der Angabeinformationen, wobei die Leistungsinformationen verwendet werden, um die erste Übertragungsleistung anzugeben, und die Zeit-Frequenz-Ressourceninformationen verwendet werden, um eine Zeit-Frequenz-Ressource anzugeben, die für das Radarsignal verwendet wird.

source: 2. The method according to claim 1, wherein the method further comprises:
de_de: 2. Verfahren nach Anspruch 1, wobei das Verfahren ferner umfasst:

source: transmitting (S360), by the first detection apparatus (500, 700), the radar signal by using the first transmit power.
de_de: Übertragen (S360) des Radarsignals durch die erste Erfassungsvorrichtung (500, 700) mit der ersten Übertragungsleistung.

source: 3. The method according to claim 2, wherein the sending, by the first detection apparatus (500, 700), time-frequency resource information and at least one of power information and the indication information comprises:
de_de: 3. Verfahren nach Anspruch 2, wobei das Senden von Zeit-Frequenz-Ressourceninformationen und der Leistungsinformationen und/oder der Angabeinformationen durch die erste Erfassungsvorrichtung (500, 700) umfasst:

source: sending, by the first detection apparatus, the time-frequency resource information and the at least one of the power information and the indication information to a communications apparatus, a processing apparatus, or a second detection apparatus.
de_de: Senden der Zeit-Frequenz-Ressourceninformationen und der Leistungsinformationen und/oder der Angabeinformationen durch die erste Erfassungsvorrichtung an eine Kommunikationsvorrichtung, eine Verarbeitungsvorrichtung oder eine zweite Erfassungsvorrichtung.

source: 4. The method according to any one of claims 1 to 3, wherein the determining (S120, S350), by the first detection apparatus (500, 700), the first transmit power based on the indication information comprises:
de_de: 4. Verfahren nach einem der Ansprüche 1 bis 3, wobei das Bestimmen (S120, S350) der ersten Übertragungsleistung durch die erste Erfassungsvorrichtung (500, 700) basierend auf den Anzeigeinformationen umfasst:

source: determining, by the first detection apparatus based on the indication information, to adjust a currently used second transmit power to the first transmit power.
de_de: Bestimmen, durch die erste Erfassungsvorrichtung basierend auf den Angabeinformationen, um die aktuell verwendete zweite Übertragungsleistung an die erste Übertragungsleitung anzupassen.

source: 5. The method according to claim 4, wherein the indication information indicates a status of a traffic light that is closest to a terminal in a current driving direction in which the first detection apparatus (500, 700) is located, and the status of the traffic light comprises a red light, a yellow light, or a green light.
de_de: 5. Verfahren nach Anspruch 4, wobei die Angabeinformationen einen Status einer Ampel angeben, die einem Endgerät in einer aktuellen Fahrtrichtung, in der sich die erste Erfassungsvorrichtung (500, 700) befindet, am nächsten ist, und der Status der Ampel ein rotes Licht, ein gelbes Licht oder ein grünes Licht umfasst.

source: 6. The method according to claim 5, wherein the determining, by the first detection apparatus (500, 700) based on the indication information, to adjust a second transmit power to the first transmit power comprises:
de_de: 6. Verfahren nach Anspruch 5, wobei das Bestimmen, durch die erste Erfassungsvorrichtung (500, 700) basierend auf den Anzeigeinformationen, um eine zweite Übertragungsleistung an eine erste Übertragungsleistung anzupassen, umfasst:

source: when the status of the traffic light is the red light, determining, by the first detection apparatus, to adjust the second transmit power to the first transmit power, wherein the first transmit power is less than or equal to the second transmit power; or
de_de: wenn der Status der Ampel das rote Licht ist, Bestimmen, durch die erste Erfassungsvorrichtung, um die zweite Übertragungsleistung an die erste Übertragungsleistung anzupassen, wobei die erste Übertragungsleistung kleiner oder gleich der zweiten Übertragungsleistung ist; oder

source: when the status of the traffic light is the green light, determining, by the first detection apparatus, to adjust the second transmit power to the first transmit power, wherein the first transmit power is greater than or equal to the second transmit power.
de_de: wenn der Status der Ampel das grüne Licht ist, Bestimmen, durch die erste Erfassungsvorrichtung, um die zweite Übertragungsleistung an die erste Übertragungsleistung anzupassen, wobei die erste Übertragungsleistung größer oder gleich der zweiten Übertragungsleistung ist.

source: 7. The method according to claim 4, wherein the indication information indicates a congestion status of a road in a current driving direction of a terminal in which the first detection apparatus (500, 700) is located, and the congestion status of the road comprises a congested state, a normal state, or a clear state.
de_de: 7. Verfahren nach Anspruch 4, wobei die Angabeinformationen einen Stauzustand einer Straße in einer aktuellen Fahrtrichtung eines Endgeräts angeben, in dem sich die erste Erfassungsvorrichtung (500, 700) befindet, und der Stauzustand der Straße einen gestauten Zustand, einen normalen Zustand oder einen freien Zustand umfasst.

source: 8. The method according to claim 7, wherein the determining, by the first detection apparatus (500, 700) based on the indication information, to adjust a second transmit power to the first transmit power comprises:
de_de: 8. Verfahren nach Anspruch 7, wobei das Bestimmen, durch die erste Erfassungsvorrichtung (500, 700) basierend auf den Anzeigeinformationen, um eine zweite Übertragungsleistung an eine erste Übertragungsleistung anzupassen, umfasst:

source: when the congestion status of the road is the congested state, determining, by the first detection apparatus, to adjust the second transmit power to the first transmit power, wherein the first transmit power is less than or equal to the second transmit power; or
de_de: wenn der Stauzustand der Straße der gestaute Zustand ist, Bestimmen, durch die erste Erfassungsvorrichtung, um die zweite Übertragungsleistung an die erste Übertragungsleistung anzupassen, wobei die erste Übertragungsleistung kleiner oder gleich der zweiten Übertragungsleistung ist; oder

source: when the congestion status of the road is the clear state, determining, by the first detection apparatus, to adjust the second transmit power to the first transmit power, wherein the first transmit power is greater than or equal to the second transmit power.
de_de: wenn der Stauzustand der Straße der freie Zustand ist, Bestimmen, durch die erste Erfassungsvorrichtung, um die zweite Übertragungsleistung an die erste Übertragungsleistung anzupassen, wobei die erste Übertragungsleistung größer oder gleich der zweiten Übertragungsleistung ist.

source: 9. An information transmission method, comprising:
de_de: 9. Informationsübertragungsverfahren, umfassend:

source: determining (S210, S330), by a first apparatus (600), indication information, wherein the indication information is used to indicate a first detection apparatus (500, 700) to determine (S120, S350) a first transmit power used for transmitting a radar signal;
de_de: Bestimmen (S210, S330) durch eine erste Vorrichtung (600) von Angabeinformationen, wobei die Angabeinformationen verwendet werden, um einer erste Erfassungsvorrichtung (500, 700) anzugeben, eine erste Übertragungsleistung zu bestimmen (S120, S350), die zum Übertragen eines Radarsignals verwendet wird;

source: sending (S220, S340), by the first apparatus, the indication information to the first detection apparatus; and
de_de: Senden (S220, S340) durch die erste Vorrichtung der Angabeinformationen an die erste Erfassungsvorrichtung; und

source: sending, by the first apparatus (600), time-frequency resource information and at least one of the power information and the indication information, wherein the time-frequency resource information is used to indicate a time-frequency resource used for the radar signal.
de_de: Senden, durch die erste Vorrichtung (600), von Zeit-Frequenz-Ressourceninformationen und der Leistungsinformationen und/oder der Angabeinformationen, wobei die Zeit-Frequenz-Ressourceninformationen verwendet werden, um eine Zeit-Frequenz-Ressource anzugeben, die für das Radarsignal verwendet wird.

source: The method according to claim 9, wherein the determining (S210, S330), by a first apparatus (600), indication information comprises:
de_de: Verfahren nach Anspruch 9, wobei das Bestimmen (S210, S330) von Anzeigeinformationen durch eine erste Vorrichtung (600) umfasst:

source: receiving (S320), by the first apparatus, the indication information sent by a second apparatus.
de_de: Empfangen (S320) der von einer zweiten Vorrichtung gesendeten Anzeigeinformationen durch die erste Vorrichtung.

source: The method according to claim 9 or 10, wherein the method further comprises:
de_de: Verfahren nach Anspruch 9 oder 10, wobei das Verfahren ferner umfasst:

source: receiving, by the first apparatus (600), power information sent by the first detection apparatus (500, 700) based on the indication information, wherein the power information is used to indicate the first transmit power.
de_de: Empfangen von Leistungsinformationen durch die erste Vorrichtung (600), die von der ersten Erfassungsvorrichtung (500, 700) basierend auf den Angabeinformationen gesendet wurden, wobei die Leistungsinformationen verwendet werden, um die erste Übertragungsleistung angeben.

source: The method according to claim 9, wherein the sending, by the first apparatus (600), time-frequency resource information and at least one of the power information and the indication information comprises:
de_de: Verfahren nach Anspruch 9, wobei das Senden von Zeit-Frequenz-Ressourceninformationen und der Leistungsinformationen und/oder der Angabeinformationen durch die erste Vorrichtung (600) umfasst:

source: sending, by the first apparatus, the time-frequency resource information and the at least one of the power information and the indication information to a communications apparatus.
de_de: Senden der Zeit-Frequenz-Ressourceninformationen und der Leistungsinformationen und/oder der Angabeinformationen durch die erste Vorrichtung an eine Kommunikationsvorrichtung.

source: A computer-readable storage medium, configured to store a computer program, wherein the computer program comprises instructions for implementing the method according to any one of claims 1 to 8, or the method according to any one of claims 9 to 12.
de_de: Computerlesbares Speichermedium, das konfiguriert ist, um ein Computerprogramm zu speichern, wobei das Computerprogramm Anweisungen zum Implementieren des Verfahrens nach einem der Ansprüche 1 bis 8 oder des Verfahrens nach einem der Ansprüche 9 bis 12 umfasst.

source: 1. An on-board diagnostic apparatus (5), comprising:
de_de: 1. Borddiagnosevorrichtung (5), umfassend:

source: a first diagnostic module (511), configured to: monitor and record first fault information;
de_de: ein erstes Diagnosemodul (511), das konfiguriert ist, um erste Fehlerinformationen zu überwachen und aufzuzeichnen;

source: a second diagnostic module (512), configured to: monitor and record second fault information, and send the second fault information to the first diagnostic module (511);
de_de: ein zweites Diagnosemodul (512), das konfiguriert ist, um zweite Fehlerinformationen zu überwachen und aufzuzeichnen und die zweiten Fehlerinformationen an das erste Diagnosemodul (511) zu senden;

source: a first communication interface, configured to enable the first diagnostic module (511) to communicate with a master computer (6); and
de_de: eine erste Kommunikationsschnittstelle, die konfiguriert ist, um das erste Diagnosemodul (511) in die Lage zu versetzen, mit einem Master-Computer (6) zu kommunizieren; und

source: a second communication interface, configured to enable the second diagnostic module (512) to communicate with the master computer (6);
de_de: eine zweite Kommunikationsschnittstelle, die konfiguriert ist, um das zweite Diagnosemodul (512) in die Lage zu versetzen, mit dem Master-Computer (6) zu kommunizieren;

source: wherein the second fault information comprises second diagnostic module fault information indicating a fault of the second diagnostic module (512);
de_de: wobei die zweiten Fehlerinformationen Fehlerinformationen des zweiten Diagnosemoduls umfassen, die einen Fehler des zweiten Diagnosemoduls (512) angeben;

source: characterized in that
de_de: dadurch gekennzeichnet, dass

source: the first diagnostic module (511) is further configured to repair the second diagnostic module (512) by restarting the second diagnostic module (512) or by upgrading software of the second diagnostic module (512) when receiving the second diagnostic module fault information; and
de_de: das erste Diagnosemodul (511) ferner konfiguriert ist, um das zweite Diagnosemodul (512) durch Neustarten des zweiten Diagnosemoduls (512) oder durch Aktualisieren von Software des zweiten Diagnosemoduls (512) zu reparieren, wenn die Fehlerinformationen des zweiten Diagnosemoduls empfangen werden; und

source: the second diagnostic module (512) corresponds to a virtual machine.
de_de: das zweite Diagnosemodul (512) einer virtuellen Maschine entspricht.

source: 2. The on-board diagnostic apparatus (5) according to claim 1, further comprising:
de_de: 2. Borddiagnosevorrichtung (5) nach Anspruch 1, ferner umfassend:

source: a third diagnostic module (513), configured to: monitor and record third fault information, and send the third fault information to the second diagnostic module (512); and
de_de: ein drittes Diagnosemodul (513), das konfiguriert ist, um dritte Fehlerinformationen zu überwachen und aufzuzeichnen und die dritten Fehlerinformationen an das zweite Diagnosemodul (512) zu senden; und

source: a third communication interface, configured to enable the third diagnostic module (513) to communicate with the master computer (6).
de_de: eine dritte Kommunikationsschnittstelle, die konfiguriert ist, um das dritte Diagnosemodul (513) in die Lage zu versetzen, mit dem Master-Computer (6) zu kommunizieren.

source: 3. The on-board diagnostic apparatus (5) according to claim 2, wherein
de_de: 3. Borddiagnosevorrichtung (5) nach Anspruch 2, wobei

source: the third fault information comprises third diagnostic module fault information indicating a fault of the third diagnostic module (513); and
de_de: die dritten Fehlerinformationen Fehlerinformationen des dritten Diagnosemoduls umfassen, die einen Fehler des dritten Diagnosemoduls (513) angeben; und

source: the second diagnostic module (512) is further configured to repair the third diagnostic module (513) when receiving the third diagnostic module fault information.
de_de: das zweite Diagnosemodul (512) ferner konfiguriert ist, um das dritte Diagnosemodul (513) zu reparieren, wenn die Fehlerinformationen des dritten Diagnosemoduls empfangen werden.

source: 4. The on-board diagnostic apparatus (5) according to any one of claims 1 to 3, wherein the first fault information comprises fault information of an underlying system.
de_de: 4. Borddiagnosevorrichtung (5) nach einem der Ansprüche 1 bis 3, wobei die ersten Fehlerinformationen Fehlerinformationen eines zugrundeliegenden Systems umfassen.
